{
  "world_cup_winner_info_T001": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://sports.ndtv.com/icc-u19-world-cup-2026/india-vs-england-live-score-u19-world-cup-2026-match-final-ind-vs-eng-live-updates-commentary-scorecard-vaibhav-suryavanshi-ayush-mhatre-10956428",
            "content": "Access Denied Access Denied You don't have permission to access \"http://sports.ndtv.com/icc-u19-world-cup-2026/india-vs-england-live-score-u19-world-cup-2026-match-final-ind-vs-eng-live-updates-commentary-scorecard-vaibhav-suryavanshi-ayush-mhatre-10956428\" on this server. Reference #18.2567d117.1770447995.196c705 https://errors.edgesuite.net/18.2567d117.1770447995.196c705",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-u-19-world-cup/from-virat-kohli-to-ayush-mhatre-check-under-19-world-cup-winners-list-as-india-beat-england-in-2026-final/articleshow/127994849.cms",
            "content": "From Virat Kohli to Ayush Mhatre: Check Under-19 World Cup winners list as India beat England in 2026 final | Cricket News - The Times of India Edition IN IN US English English     Weather Sign In TOI Under-19 WC Schedule Points Table Teams Today's ePaper News Sports News Cricket News From Virat Kohli to Ayush Mhatre: Check Under-19 World Cup winners list as India beat England in 2026 final Trending Rishabh Pant Ben Stokes IND vs ENG U19 World Cup Live Score Pakistan Cricket Board WPL 2026 ICC T20 World Cup Schedule Suryakumar Yadav Smriti Mandhana Rohit Sharma ICC T20 World Cup Points Table Rishabh Pant Ben Stokes IND vs ENG U19 World Cup Live Score Pakistan Cricket Board WPL 2026 ICC T20 World Cup Schedule Suryakumar Yadav Smriti Mandhana Rohit Sharma ICC T20 World Cup Points Table Rishabh Pant Ben Stokes IND vs ENG U19 World Cup Live Score Pakistan Cricket Board WPL 2026 ICC T20 World Cup Schedule Suryakumar Yadav Smriti Mandhana Rohit Sharma ICC T20 World Cup Points Table From Virat Kohli to Ayush Mhatre: Check Under-19 World Cup winners list as India beat England in 2026 final TOI Sports Desk / TIMESOFINDIA.COM / Updated: Feb 06, 2026, 22:16 IST Comments Share AA + Text Size Small Medium Large India U19 men's cricket team (Photo by @BCCI on X) NEW DELHI: India U19 crowned themselves champions of the ICC Under-19 World Cup 2026 for a record-extending sixth time after defeating England U19 by 100 runs in the final at Harare Sports Club on Friday, sealing the title in emphatic fashion. Batting first after winning the toss, India piled on a massive 411 for 9 in their 50 overs, driven by a breathtaking knock from Vaibhav Sooryavanshi. T20 World Cup Groups Explained: Who Can Reach the Super 8 The teenage opener smashed 175 off just 80 balls, hammering 15 fours and 15 sixes to completely dominate Englands bowling. Captain Ayush Mhatre added a composed half-century, while late fireworks from Kanishk Chouhan ensured India crossed the 400 mark. Chasing a daunting target, England fought hard but never truly got ahead of the asking rate. Ben Dawkins and Ben Mayes provided early resistance, while Caleb Falconer kept England alive with an aggressive knock of 115. However, regular wickets in the middle overs slowed the chase. Indias bowlers shared the workload, with Deepesh Devendran picking up multiple wickets and Ayush Mhatre and Kanishk Chouhan striking at key moments. England eventually finished on 311 all out in 40.2 overs, falling well short as India completed a dominant win to lift the trophy. The victory marks another milestone for Indias rich Under-19 legacy. ICC U19 Mens World Cup Winners List (hosts mentioned in the bracket) 1988 (Australia): Australia Captain: Geoff Parker 1998 (South Africa): England Captain: Owais Shah 2000 (Sri Lanka): India Captain: Mohammad Kaif 2002 (New Zealand): Australia Captain: Cameron White 2004 (Bangladesh): Pakistan Captain: Khalid Latif 2006 (Sri Lanka): Pakistan Captain: Sarfaraz Ahmed 2008 (Malaysia): India Captain: Virat Kohli 2010 (New Zealand): Australia Captain: Mitchell Marsh 2012 (Australia): India Captain: Unmukt Chand 2014 (UAE): South Africa Captain: Aiden Markram 2016 (Bangladesh): West Indies Captain: Shimron Hetmyer 2018 (New Zealand): India Captain: Prithvi Shaw 2020 (South Africa): Bangladesh Captain: Towhid Hridoy 2022 (West Indies): India Captain: Yash Dhull 2024 (South Africa): Australia Captain: Hugh Weibgen 2026 (Zimbabwe): India Captain: Ayush Mhatre Get the latest ICC Mens T20 World Cup 2026 updates, including the full schedule , teams , live scores , points table , and key series stats such as top run-scorers and wicket-takers. About the Author TOI Sports Desk At TOI Sports Desk, reporters work around the clock to bring you comprehensive updates from the world of sports. Expect nuanced match reports, previews, and reviews, along with statistics-based technical analysis, the latest social media trends, and expert insights across cricket, football, ten",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://sportsboardindia.com/cricket/under-19-world-cup-winners-list/",
            "content": "Under-19 World Cup Winners & Runner Ups List (1988 to 2026) Skip to content Home About Contact Us IPL Betting Apps Blog View Certificate Main Menu Home About Contact Us IPL Betting Apps Blog Cricket Under-19 World Cup Winners & Runner Ups List (1988 to 2026) January 21, 2026 Written By: Devraj Chauhan Australia and India have defined the ICC Under-19 World Cup era, winning five titles each and accounting for nearly two-thirds of all championships. Together, they have featured in 13 finals and consistently produced players who later excelled at the senior international level, setting global standards in youth development. Australia displayed its dominance with decisive final victories, winning by 113 runs in 2002 and by 79 runs in 2024. India stands out for its consistency, reaching 9 finals and lifting trophies under diverse conditions, including overseas triumphs in 2012 and 2022. This article reviews all 15 finals from 1988 to 2024, illustrating how junior success shapes long-term international excellence. Complete List of ICC Under-19 World Cup Winners In this table, the complete list of ICC Under-19 World Cup winners is presented by year and team. Source: News18 Season Winner Runners-up Host Country 1987/88 Australia Under-19 Pakistan Under-19 Australia 1997/98 England Under-19 New Zealand Under-19 South Africa 1999/00 India Under-19 Sri Lanka Under-19 Sri Lanka 2001/02 Australia Under-19 South Africa Under-19 New Zealand 2003/04 Pakistan Under-19 West Indies Under-19 Bangladesh 2005/06 Pakistan Under-19 India Under-19 Sri Lanka 2007/08 India Under-19 South Africa Under-19 Malaysia 2009/10 Australia Under-19 Pakistan Under-19 New Zealand 2012 India Under-19 Australia Under-19 Australia 2013/14 South Africa Under-19 Pakistan Under-19 United Arab Emirates 2015/16 West Indies Under-19 India Under-19 Bangladesh 2017/18 India Under-19 Australia Under-19 New Zealand 2019/20 Bangladesh Under-19 India Under-19 South Africa 2021/22 India Under-19 England Under-19 West Indies 2023/24 Australia Under-19 India Under-19 South Africa Source: ESPNcricinfo 1. 1987/88 Australia Australia won the inaugural McDonalds Bicentennial Youth World Cup by defeating Pakistan by 5 wickets in the final at Adelaide on 13 March 1988. Batting first, Pakistan Young Cricketers scored 201, showing resistance but failing to accelerate in the final overs of their 50-over innings. Source: ESPNcricinfo Chasing 202, Australia responded calmly, reaching 202/5 in 45.5 overs with 25 balls to spare, showcasing superior game management. Brett Williams was the standout, scoring a match-defining 108 off 134 balls and earning Player of the Match. His century remains one of the earliest iconic knocks in U19 World Cup finals history, marking Australias first youth world title and setting the stage for long-term dominance. 2. 1997/98 England England claimed their only ICC Under-19 Cricket World Cup title by defeating New Zealand Under-19s by 7 wickets in the final at Johannesburg on 1 February 1998. Batting first, New Zealand scored 241/6, relying on steady top-order contributions without late acceleration. Source: ESPNcricinfo Chasing 242, England reached 242/3 in 46 overs with 24 balls remaining, showcasing controlled, mature batting under pressure. Stephen Peters earned Player of the Match with a composed 107 off 125 balls, anchoring the chase. Englands strong partnerships and calm finishing reflected the strength of their youth system, producing future county cricket regulars and marking a rare, significant triumph. 3. 1999/00 India India secured their maiden ICC Under-19 Cricket World Cup title by defeating Sri Lanka Under-19s by 6 wickets in the final at Sinhalese Sports Club, Colombo, on 28 January 2000. Batting first, Sri Lanka were bowled out for 178, struggling against Indias disciplined bowling in the middle overs. Chasing 179, India reached 180/4 in 40.4 overs with 56 balls remaining, displaying calm composure. Reetinder Sodhi earned Player of the Match with",
            "images": [],
            "rank": 3
          }
        ],
        "annotations": null,
        "_meta": null
      }
    ]
  }
}